; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph1 - mode
	image0 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star5 - direction
	GroundStation7 - direction
	Star8 - direction
	Star9 - direction
	GroundStation10 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
	GroundStation6 - direction
	GroundStation15 - direction
	GroundStation4 - direction
	Star16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Star19 - direction
	Phenomenon20 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 thermograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation15)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
)
(:goal (and
	(have_image Star16 image0)
	(have_image Phenomenon17 image0)
	(have_image Planet18 image0)
	(have_image Star19 thermograph1)
	(have_image Phenomenon20 thermograph1)
))

)

; plan
1. (turn_to satellite0 groundstation6 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation6)
   goals met: 0 of 5
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
3. (calibrate satellite0 instrument0 groundstation6)
   added: (calibrated instrument0)
   goals met: 0 of 5
4. (turn_to satellite0 planet18 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 planet18)
   goals met: 0 of 5
5. (take_image satellite0 planet18 instrument0 image0)
   added: (have_image planet18 image0)
   goals met: 1 of 5
6. (turn_to satellite0 phenomenon20 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 phenomenon20)
   goals met: 1 of 5
7. (take_image satellite0 phenomenon20 instrument0 thermograph1)
   added: (have_image phenomenon20 thermograph1)
   goals met: 2 of 5
8. (turn_to satellite0 phenomenon17 phenomenon20)
   deleted: (pointing satellite0 phenomenon20)
   added: (pointing satellite0 phenomenon17)
   goals met: 2 of 5
9. (take_image satellite0 phenomenon17 instrument0 image0)
   added: (have_image phenomenon17 image0)
   goals met: 3 of 5
10. (turn_to satellite0 star16 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 star16)
   goals met: 3 of 5
11. (take_image satellite0 star16 instrument0 image0)
   added: (have_image star16 image0)
   goals met: 4 of 5
12. (turn_to satellite0 star19 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star19)
   goals met: 4 of 5
13. (take_image satellite0 star19 instrument0 thermograph1)
   added: (have_image star19 thermograph1)
   goals met: 5 of 5
